#include <stdio.h>
#include <stdlib.h>
/**
 * @description: 序列比对
 *               为确定两个序列之间的相似性或同源性,
 *               将它们按照一定的规律排列,进行比对
 *               
 *               序列之间的编辑距离
 *               给定两个序列S1和S2,通过一系列字符编辑
 *               (插入、删除、替换)等操作,将S1转变成S2
 *               完成这种转换所需要的最少的编辑操作个数
 *               称为S1和S2的编辑距离
 * 
 * @method: 子问题界定和归约
 *          S1[1..n]和S2[1..m]表示两个序列
 *          子问题: S1[1..i]和S2[1..j],边界(i,j)
 *          操作            归约子问题          编辑距离
 *          删除S1[i]        (i-1,j)              +1
 *          S1[i]后插入S2[j] (i,j-1)              +1
 *          S1[i]替换为S2[j] (i-1,j-1)            +1
 *          S1[i]=S2[j]      (i-1,j-1)           +0
 * 
 *          优化函数的递推方程
 *          C[i,j]: S1[1..i]和S2[1..j]的编辑距离
 *          C[i,j] = min{C[i-1,j] + 1, C[i,j-1] + 1, C[i-1,j-1] + t[i,j]}
 *          // 上四种操作分别对应删除、插入、替换和相同
 *          当S1[i] = S2[j]时,t[i,j] = 0
 *          当S1[i] != S2[j]时,t[i,j] = 1
 *          C[0,j] = j, C[i,0] = i
 * 
 *          时间复杂度: O(n*m)
 * 
 * @link: https://www.bilibili.com/video/av7134874?p=49
 **/
int main(){

    return 0;
}